## leetcode 181 Employees Earning More Than Their Managers

In [1]:
import numpy as np
import pandas as pd
Employee_181 = pd.DataFrame({'Id':[1,2,3,4],
                             'Name':['Joe','Henry','Sam','Max'],
                             'Salary':[70000,80000,60000,90000],
                             'ManagerId':[3,4,np.nan,np.nan]})
Employee_181

   Id  ManagerId   Name  Salary
0   1        3.0    Joe   70000
1   2        4.0  Henry   80000
2   3        NaN    Sam   60000
3   4        NaN    Max   90000

In [2]:
newdf=pd.merge(Employee_181,Employee_181,left_on='ManagerId',right_on='Id', how='outer')
newdf

   Id_x ManagerId_x Name_x  Salary_x  Id_y ManagerId_y Name_y  Salary_y
0   1.0           3    Joe   70000.0   3.0         NaN    Sam   60000.0
1   2.0           4  Henry   80000.0   4.0         NaN    Max   90000.0
2   3.0         NaN    Sam   60000.0   NaN         NaN    NaN       NaN
3   4.0         NaN    Max   90000.0   NaN         NaN    NaN       NaN
4   NaN         NaN    NaN       NaN   1.0           3    Joe   70000.0
5   NaN         NaN    NaN       NaN   2.0           4  Henry   80000.0

In [3]:
sub=newdf.loc[(newdf['ManagerId_x']==newdf['Id_y'])]
sub

   Id_x ManagerId_x Name_x  Salary_x  Id_y ManagerId_y Name_y  Salary_y
0   1.0           3    Joe   70000.0   3.0         NaN    Sam   60000.0
1   2.0           4  Henry   80000.0   4.0         NaN    Max   90000.0

In [4]:
sub[sub['Salary_x']>sub['Salary_y']]

   Id_x ManagerId_x Name_x  Salary_x  Id_y ManagerId_y Name_y  Salary_y
0   1.0           3    Joe   70000.0   3.0         NaN    Sam   60000.0

In [5]:
sub[sub['Salary_x']>sub['Salary_y']].Name_x

0    Joe
Name: Name_x, dtype: object